#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
proxmox_vm_qemu.cloudflare-tunnel: Refreshing state... [id=milky-capella/qemu/201]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_vm_qemu.cloudflare-tunnel is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "cloudflare-tunnel" {
      ~ boot                   = "order=scsi0" -> (known after apply)
      + bootdisk               = (known after apply)
      - ciuser                 = "ubuntu" -> null
      ~ default_ipv4_address   = "10.0.0.50" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "milky-capella/qemu/201" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "cloudflare-tunnel"
      + nameserver             = (known after apply)
      - numa                   = false -> null
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      ~ scsihw                 = "lsi" -> "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      ~ ssh_host               = "10.0.0.50" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCYJ+2ClRzkGAI2t1AvdlmlGD72Q6rnKrtY8oeFZj/D9Mj2PEKadd+u+R27w4BUG126sN4yVwBt+iO3WxayVUB6Kp+YL4Zgs1f3R5R4d/OA1Cr0lIRe6vx3+0WAv50Asqf80Jrb6azukuRPnpXs9jjlzoFUyPCvJhBpAQHypi0WUMfYflJRrMekWFLUg3BmRM5h/WWYgdOkbzf1W8kuSl0JpGX7/iPyLtqD2j84bKaqdYWQPYtWSv6E4/wdSGBgczyW8wLvw9H6XSHf5jJFhyCk3y9YX03QXjK1vXy8DT8v1PKBIubpKkI5UBtE1jelgIB5eaVXjpXQ6yFS3UIoWceuMvzp2dcPj6tiiCz7PpJh5lxiMEUNa9TEKuhjEvYQInyiHw7kY8+XbjWWc0ex9x/5lFfo501eq7aF/LvYH8powrq93JckEl42aZIFdIIOzJNIZXnRwFvjsgNwWYM0/VH1yBUeWHypvwuVYPKWmspyV2bCeD6UwsLFnCt53coMJdE= root@a4f8a56c1e24
        EOT
      + tags                   = (known after apply)
      ~ unused_disk            = [] -> (known after apply)
      ~ vmid                   = 201 -> 202
        # (53 unchanged attributes hidden)

      - disks {
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "20G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
          ~ macaddr   = "6E:95:D0:95:59:69" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ smbios {
          + additional_wait             = (known after apply)
          + agent                       = (known after apply)
          + agent_timeout               = (known after apply)
          + args                        = (known after apply)
          + automatic_reboot            = (known after apply)
          + balloon                     = (known after apply)
          + bios                        = (known after apply)
          + boot                        = (known after apply)
          + bootdisk                    = (known after apply)
          + ci_wait                     = (known after apply)
          + cicustom                    = (known after apply)
          + cipassword                  = (known after apply)
          + ciuser                      = (known after apply)
          + clone                       = (known after apply)
          + clone_wait                  = (known after apply)
          + cores                       = (known after apply)
          + cpu                         = (known after apply)
          + default_ipv4_address        = (known after apply)
          + default_ipv6_address        = (known after apply)
          + define_connection_info      = (known after apply)
          + desc                        = (known after apply)
          + force_create                = (known after apply)
          + force_recreate_on_change_of = (known after apply)
          + full_clone                  = (known after apply)
          + hagroup                     = (known after apply)
          + hastate                     = (known after apply)
          + hotplug                     = (known after apply)
          + id                          = (known after apply)
          + ipconfig0                   = (known after apply)
          + ipconfig1                   = (known after apply)
          + ipconfig10                  = (known after apply)
          + ipconfig11                  = (known after apply)
          + ipconfig12                  = (known after apply)
          + ipconfig13                  = (known after apply)
          + ipconfig14                  = (known after apply)
          + ipconfig15                  = (known after apply)
          + ipconfig2                   = (known after apply)
          + ipconfig3                   = (known after apply)
          + ipconfig4                   = (known after apply)
          + ipconfig5                   = (known after apply)
          + ipconfig6                   = (known after apply)
          + ipconfig7                   = (known after apply)
          + ipconfig8                   = (known after apply)
          + ipconfig9                   = (known after apply)
          + kvm                         = (known after apply)
          + linked_vmid                 = (known after apply)
          + machine                     = (known after apply)
          + memory                      = (known after apply)
          + name                        = (known after apply)
          + nameserver                  = (known after apply)
          + numa                        = (known after apply)
          + onboot                      = (known after apply)
          + os_network_config           = (known after apply)
          + os_type                     = (known after apply)
          + pool                        = (known after apply)
          + protection                  = (known after apply)
          + pxe                         = (known after apply)
          + qemu_os                     = (known after apply)
          + reboot_required             = (known after apply)
          + scsihw                      = (known after apply)
          + searchdomain                = (known after apply)
          + skip_ipv4                   = (known after apply)
          + skip_ipv6                   = (known after apply)
          + sockets                     = (known after apply)
          + ssh_forward_ip              = (known after apply)
          + ssh_host                    = (known after apply)
          + ssh_port                    = (known after apply)
          + ssh_private_key             = (known after apply)
          + ssh_user                    = (known after apply)
          + sshkeys                     = (known after apply)
          + startup                     = (known after apply)
          + tablet                      = (known after apply)
          + tags                        = (known after apply)
          + target_node                 = (known after apply)
          + target_nodes                = (known after apply)
          + unused_disk                 = (known after apply)
          + vcpus                       = (known after apply)
          + vm_state                    = (known after apply)
          + vmid                        = (known after apply)
        } -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Walkmana-25, Action: `pull_request`*